# IsEqualTo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeTypeOptions..::..IsEqualTo Method
DirectShapeTypeOptions Class See Also
---
Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsEqualTo(
	DirectShapeTypeOptions other
)
```

Visual Basic
---
```text
Public Function IsEqualTo ( _
	other As DirectShapeTypeOptions _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqualTo(
	DirectShapeTypeOptions^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..DirectShapeTypeOptions the DirectShapeTypeOptions object to be compared.
# ### Return Value
True if both objects specify the same options.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace